app/controllers/gps_samples_controller.rb

  def post_user_mobility
    @user = User.where(:name => gps_params[:user_name]).first_or_create(:name => gps_params[:user_name])

    if(gps_params[:sample])
      @route = JSON.parse(gps_params[:sample].read)
      @route['route'].each do |location|
        Gps_sample.where(:users_id => @user.id,
                         :latitude=> location['latitude'],
                         :longitude => location['longitude']).first_or_create(
            :latitude => location['latitude'],
            :longitude => location['longitude'],
            :users_id => @user.id)
---
INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "Esteban"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["name", "Esteban"], ["LIMIT", 1]]
INSERT INTO "gps_samples" ("latitude", "longitude", "users_id") VALUES ($1, $2, $3) RETURNING "id"  [["latitude", 31.870680441020795], ["longitude", -116.59898800391464], ["users_id", 2]]
SELECT  "gps_samples".* FROM "gps_samples" WHERE "gps_samples"."users_id" = $1 AND "gps_samples"."latitude" = $2 AND "gps_samples"."longitude" = $3 ORDER BY "gps_samples"."id" ASC LIMIT $4  [["users_id", 2], ["latitude", 31.86004684940118], ["longitude", -116.60911602515446], ["LIMIT", 1]]