app/controllers/locations_controller.rb

  def index
    # get all locations in the table locations
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    # create a new instance variable called @location that holds a Location object built from the data the user submitted
    @location = Location.new(location_params)

    # if the object saves correctly to the database
    if @location.save
---
INSERT INTO "locations" ("name", "description") VALUES (?, ?)  [["name", ""], ["description", ""]]

  def update
    # find only the location that has the id defined in params[:id]
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def show_near
    if location_near[:latitude]
      @location = Location.new({:latitude => location_near[:latitude], :longitude => location_near[:longitude], :name => '', :description => ''})
      @locations = Location.get_near_locations(@location,Location.all,location_near[:radius])
---
SELECT "locations".* FROM "locations"

  def convex_hull
    @all_locations = Location.all
    @convex_hull_locations = Location.convex_hull(@all_locations)
    @perimeter = Location.perimeter(@convex_hull_locations)
    @farthest_distance_from_home = Location.get_farthest_distance(Location.find_by_name('Casa'), @all_locations)
---
SELECT "locations".* FROM "locations"
SELECT  "locations".* FROM "locations" WHERE "locations"."name" = ? LIMIT ?  [["name", "Casa"], ["LIMIT", 1]]